# Задача 1 Есть список a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]. Выведите все элементы, которые меньше 5.

a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
# b=[]
# for elem in a:
#     if elem <5:
#         b.append(elem)
# print(b)


#_____________________________________________

print([elem for elem in a if elem < 5])