# Задача 18  Посчитайте, сколько раз символ встречается в строке.


# n='lkjjhbvf 23'
# count=0
# for d in n:
#    count+=1
#    print (count)   # всего символов

n = 'mmmmmm xxxxxxx nnnnn pppppppppp xxxxxx'
c=n.count('x')
print(c)