#Задача 11 Выведите первый и последний элемент списка.

a= [5, 8, 7, 9, 7]

print(a[0])
print(a[-1])